<?php

/* @var $this yii\web\View */

$this->title = 'Главная';
?>
<div class="site-index">

    <div class="jumbotron text-center bg-transparent">
        <h1 class="display-4">ТЗ для Red Promo!</h1>
    </div>

    <div class="body-content">
    <p> Задачи разделены на 3 уровня, минимально необходимо реализовать задачи из первого уровня. Если навыки позволяют, то также желательна реализация задач из второго или третьего уровня. </p>
    
    <h4>Выполнен только первый уровень</h4>
    <p>Первый уровень: </p>
    
    <ul>- Главная страница с избранными новостями (некоторые новости отмечены в базе как избранные, пользователь с этим не взаимодействует)</ul>
    <ul>- Страница всех новостей </ul>
    <ul>- Страница отдельной новости (новость состоит из изображения, заголовка, краткого описания, текста) </ul>
    
    <p>Второй уровень: </p>
    <ul>- Раздел “Похожие новости” на странице отдельной новости </ul>
    <ul>- Поиск по новостям </ul>
     
    <p>Третий уровень: </p>
    <ul>- Переключение между двумя городами. К каждому городу привязаны как свои так и общие новости. </ul>
    <ul>- Избранные новости на главной, выбираемые пользователем (у каждой новости есть кнопка “Добавить в избранное“) </ul>
     
    <p>По дизайну/верстке предпочтений нет, можно использовать базовые стили Bootstrap. Тематика новостей на ваше усмотрение. Административную панель разрабатывать не обязательно, таблицы можно заполнять напрямую.
    От вас ждем код и базу данных созданного проекта. Передать проект можно как в виде архива, так и путем размещения на github. </p>
    </div>
</div>
